loadtest/results/smoke-test-output-v2.txt
time="2025-11-20T23:50:01Z" level=warning msg="/home/ubuntu/heartguard-poc/docker-compose.loadtest.yml: the attribute `version` is obsolete, it will be ignored, please remove it to avoid potential confusion"

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m01.0s/5m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.0s/5m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.0s/5m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m04.0s/5m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.0s/5m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.0s/5m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m07.0s/5m0s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.0s/5m0s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.0s/5m0s

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m10.0s/5m0s

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.0s/5m0s

running (0m12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.0s/5m0s

running (0m13.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m13.0s/5m0s

running (0m14.0s), 10/10 VUs, 6 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.0s/5m0s

running (0m15.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.0s/5m0s

running (0m16.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m16.0s/5m0s

running (0m17.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.0s/5m0s

running (0m18.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.0s/5m0s

running (0m19.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m19.0s/5m0s

running (0m20.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.0s/5m0s

running (0m21.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.0s/5m0s

running (0m22.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m22.0s/5m0s

running (0m23.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.0s/5m0s

running (0m24.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.0s/5m0s

running (0m25.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m25.0s/5m0s

running (0m26.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.0s/5m0s

running (0m27.0s), 10/10 VUs, 15 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.0s/5m0s

running (0m28.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m28.0s/5m0s

running (0m29.0s), 10/10 VUs, 19 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.0s/5m0s

running (0m30.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.0s/5m0s

running (0m31.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m31.0s/5m0s

running (0m32.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m32.0s/5m0s

running (0m33.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m33.0s/5m0s

running (0m34.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m34.0s/5m0s

running (0m35.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m35.0s/5m0s

running (0m36.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m36.0s/5m0s

running (0m37.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m37.0s/5m0s

running (0m38.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m38.0s/5m0s

running (0m39.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m39.0s/5m0s

running (0m40.0s), 10/10 VUs, 22 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m40.0s/5m0s

running (0m41.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m41.0s/5m0s

running (0m42.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m42.0s/5m0s

running (0m43.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m43.0s/5m0s

running (0m44.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m44.0s/5m0s

running (0m45.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m45.0s/5m0s

running (0m46.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m46.0s/5m0s

running (0m47.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m47.0s/5m0s

running (0m48.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m48.0s/5m0s

running (0m49.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m49.0s/5m0s

running (0m50.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m50.0s/5m0s

running (0m51.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m51.0s/5m0s

running (0m52.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m52.0s/5m0s

running (0m53.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m53.0s/5m0s

running (0m54.0s), 10/10 VUs, 35 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m54.0s/5m0s

running (0m55.0s), 10/10 VUs, 35 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m55.0s/5m0s

running (0m56.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m56.0s/5m0s

running (0m57.0s), 10/10 VUs, 38 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m57.0s/5m0s

running (0m58.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m58.0s/5m0s

running (0m59.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m59.0s/5m0s

running (1m00.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m00.0s/5m0s

running (1m01.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m01.0s/5m0s

running (1m02.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m02.0s/5m0s

running (1m03.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m03.0s/5m0s

running (1m04.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m04.0s/5m0s

running (1m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m05.0s/5m0s

running (1m06.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m06.0s/5m0s

running (1m07.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m07.0s/5m0s

running (1m08.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m08.0s/5m0s

running (1m09.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m09.0s/5m0s

running (1m10.0s), 10/10 VUs, 47 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m10.0s/5m0s

running (1m11.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m11.0s/5m0s

running (1m12.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m12.0s/5m0s

running (1m13.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m13.0s/5m0s

running (1m14.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m14.0s/5m0s

running (1m15.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m15.0s/5m0s

running (1m16.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m16.0s/5m0s

running (1m17.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m17.0s/5m0s

running (1m18.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m18.0s/5m0s

running (1m19.0s), 10/10 VUs, 51 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m19.0s/5m0s

running (1m20.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m20.0s/5m0s

running (1m21.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m21.0s/5m0s

running (1m22.0s), 10/10 VUs, 54 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m22.0s/5m0s

running (1m23.0s), 10/10 VUs, 56 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m23.0s/5m0s

running (1m24.0s), 10/10 VUs, 58 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m24.0s/5m0s

running (1m25.0s), 10/10 VUs, 59 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m25.0s/5m0s

running (1m26.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m26.0s/5m0s

running (1m27.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m27.0s/5m0s

running (1m28.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m28.0s/5m0s

running (1m29.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m29.0s/5m0s

running (1m30.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m30.0s/5m0s

running (1m31.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m31.0s/5m0s

running (1m32.0s), 10/10 VUs, 61 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m32.0s/5m0s

running (1m33.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m33.0s/5m0s

running (1m34.0s), 10/10 VUs, 63 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m34.0s/5m0s

running (1m35.0s), 10/10 VUs, 63 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m35.0s/5m0s

running (1m36.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m36.0s/5m0s

running (1m37.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m37.0s/5m0s

running (1m38.0s), 10/10 VUs, 69 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m38.0s/5m0s

running (1m39.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m39.0s/5m0s

running (1m40.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m40.0s/5m0s

running (1m41.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m41.0s/5m0s

running (1m42.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m42.0s/5m0s

running (1m43.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m43.0s/5m0s

running (1m44.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m44.0s/5m0s

running (1m45.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m45.0s/5m0s

running (1m46.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m46.0s/5m0s

running (1m47.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m47.0s/5m0s

running (1m48.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m48.0s/5m0s

running (1m49.0s), 10/10 VUs, 74 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m49.0s/5m0s

running (1m50.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m50.0s/5m0s

running (1m51.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m51.0s/5m0s

running (1m52.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m52.0s/5m0s

running (1m53.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m53.0s/5m0s

running (1m54.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m54.0s/5m0s

running (1m55.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m55.0s/5m0s

running (1m56.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m56.0s/5m0s

running (1m57.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m57.0s/5m0s

running (1m58.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m58.0s/5m0s

running (1m59.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m59.0s/5m0s

running (2m00.0s), 10/10 VUs, 81 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m00.0s/5m0s

running (2m01.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m01.0s/5m0s

running (2m02.0s), 10/10 VUs, 85 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m02.0s/5m0s

running (2m03.0s), 10/10 VUs, 85 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m03.0s/5m0s

running (2m04.0s), 10/10 VUs, 86 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m04.0s/5m0s

running (2m05.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m05.0s/5m0s

running (2m06.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m06.0s/5m0s

running (2m07.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m07.0s/5m0s

running (2m08.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m08.0s/5m0s

running (2m09.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m09.0s/5m0s

running (2m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m10.0s/5m0s

running (2m11.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m11.0s/5m0s

running (2m12.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m12.0s/5m0s

running (2m13.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m13.0s/5m0s

running (2m14.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m14.0s/5m0s

running (2m15.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m15.0s/5m0s

running (2m16.0s), 10/10 VUs, 95 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m16.0s/5m0s

running (2m17.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m17.0s/5m0s

running (2m18.0s), 10/10 VUs, 97 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m18.0s/5m0s

running (2m19.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m19.0s/5m0s

running (2m20.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m20.0s/5m0s

running (2m21.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m21.0s/5m0s

running (2m22.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m22.0s/5m0s

running (2m23.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m23.0s/5m0s

running (2m24.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m24.0s/5m0s

running (2m25.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m25.0s/5m0s

running (2m26.0s), 10/10 VUs, 102 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m26.0s/5m0s

running (2m27.0s), 10/10 VUs, 102 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m27.0s/5m0s

running (2m28.0s), 10/10 VUs, 102 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m28.0s/5m0s

running (2m29.0s), 10/10 VUs, 102 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m29.0s/5m0s

running (2m30.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m30.0s/5m0s

running (2m31.0s), 10/10 VUs, 107 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m31.0s/5m0s

running (2m32.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m32.0s/5m0s

running (2m33.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m33.0s/5m0s

running (2m34.0s), 10/10 VUs, 109 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m34.0s/5m0s

running (2m35.0s), 10/10 VUs, 109 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m35.0s/5m0s

running (2m36.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m36.0s/5m0s

running (2m37.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m37.0s/5m0s

running (2m38.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m38.0s/5m0s

running (2m39.0s), 10/10 VUs, 111 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m39.0s/5m0s

running (2m40.0s), 10/10 VUs, 112 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m40.0s/5m0s

running (2m41.0s), 10/10 VUs, 112 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m41.0s/5m0s

running (2m42.0s), 10/10 VUs, 112 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m42.0s/5m0s

running (2m43.0s), 10/10 VUs, 112 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m43.0s/5m0s

running (2m44.0s), 10/10 VUs, 114 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m44.0s/5m0s

running (2m45.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m45.0s/5m0s

running (2m46.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m46.0s/5m0s

running (2m47.0s), 10/10 VUs, 118 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m47.0s/5m0s

running (2m48.0s), 10/10 VUs, 118 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m48.0s/5m0s

running (2m49.0s), 10/10 VUs, 119 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m49.0s/5m0s

running (2m50.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m50.0s/5m0s

running (2m51.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m51.0s/5m0s

running (2m52.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m52.0s/5m0s

running (2m53.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m53.0s/5m0s

running (2m54.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m54.0s/5m0s

running (2m55.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m55.0s/5m0s

running (2m56.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m56.0s/5m0s

running (2m57.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m57.0s/5m0s

running (2m58.0s), 10/10 VUs, 124 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m58.0s/5m0s

running (2m59.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m59.0s/5m0s

running (3m00.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m00.0s/5m0s

running (3m01.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m01.0s/5m0s

running (3m02.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m02.0s/5m0s

running (3m03.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m03.0s/5m0s

running (3m04.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m04.0s/5m0s

running (3m05.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m05.0s/5m0s

running (3m06.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m06.0s/5m0s

running (3m07.0s), 10/10 VUs, 131 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m07.0s/5m0s

running (3m08.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m08.0s/5m0s

running (3m09.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m09.0s/5m0s

running (3m10.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m10.0s/5m0s

running (3m11.0s), 10/10 VUs, 133 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m11.0s/5m0s

running (3m12.0s), 10/10 VUs, 134 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m12.0s/5m0s

running (3m13.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m13.0s/5m0s

running (3m14.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m14.0s/5m0s

running (3m15.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m15.0s/5m0s

running (3m16.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m16.0s/5m0s

running (3m17.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m17.0s/5m0s

running (3m18.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m18.0s/5m0s

running (3m19.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m19.0s/5m0s

running (3m20.0s), 10/10 VUs, 141 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m20.0s/5m0s

running (3m21.0s), 10/10 VUs, 141 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m21.0s/5m0s

running (3m22.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m22.0s/5m0s

running (3m23.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m23.0s/5m0s

running (3m24.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m24.0s/5m0s

running (3m25.0s), 10/10 VUs, 143 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m25.0s/5m0s

running (3m26.0s), 10/10 VUs, 146 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m26.0s/5m0s

running (3m27.0s), 10/10 VUs, 146 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m27.0s/5m0s

running (3m28.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m28.0s/5m0s

running (3m29.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m29.0s/5m0s

running (3m30.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m30.0s/5m0s

running (3m31.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m31.0s/5m0s

running (3m32.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m32.0s/5m0s

running (3m33.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m33.0s/5m0s

running (3m34.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m34.0s/5m0s

running (3m35.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m35.0s/5m0s

running (3m36.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m36.0s/5m0s

running (3m37.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m37.0s/5m0s

running (3m38.0s), 10/10 VUs, 153 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m38.0s/5m0s

running (3m39.0s), 10/10 VUs, 153 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m39.0s/5m0s

running (3m40.0s), 10/10 VUs, 156 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m40.0s/5m0s

running (3m41.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m41.0s/5m0s

running (3m42.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m42.0s/5m0s

running (3m43.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m43.0s/5m0s

running (3m44.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m44.0s/5m0s

running (3m45.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m45.0s/5m0s

running (3m46.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m46.0s/5m0s

running (3m47.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m47.0s/5m0s

running (3m48.0s), 10/10 VUs, 161 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m48.0s/5m0s

running (3m49.0s), 10/10 VUs, 162 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m49.0s/5m0s

running (3m50.0s), 10/10 VUs, 162 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m50.0s/5m0s

running (3m51.0s), 10/10 VUs, 162 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m51.0s/5m0s

running (3m52.0s), 10/10 VUs, 163 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m52.0s/5m0s

running (3m53.0s), 10/10 VUs, 164 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m53.0s/5m0s

running (3m54.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m54.0s/5m0s

running (3m55.0s), 10/10 VUs, 167 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m55.0s/5m0s

running (3m56.0s), 10/10 VUs, 167 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m56.0s/5m0s

running (3m57.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m57.0s/5m0s

running (3m58.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m58.0s/5m0s

running (3m59.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m59.0s/5m0s

running (4m00.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m00.0s/5m0s

running (4m01.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m01.0s/5m0s

running (4m02.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m02.0s/5m0s

running (4m03.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m03.0s/5m0s

running (4m04.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m04.0s/5m0s

running (4m05.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m05.0s/5m0s

running (4m06.0s), 10/10 VUs, 175 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m06.0s/5m0s

running (4m07.0s), 10/10 VUs, 176 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m07.0s/5m0s

running (4m08.0s), 10/10 VUs, 177 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m08.0s/5m0s

running (4m09.0s), 10/10 VUs, 177 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m09.0s/5m0s

running (4m10.0s), 10/10 VUs, 178 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m10.0s/5m0s

running (4m11.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m11.0s/5m0s

running (4m12.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m12.0s/5m0s

running (4m13.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m13.0s/5m0s

running (4m14.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m14.0s/5m0s

running (4m15.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m15.0s/5m0s

running (4m16.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m16.0s/5m0s

running (4m17.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m17.0s/5m0s

running (4m18.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m18.0s/5m0s

running (4m19.0s), 10/10 VUs, 184 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m19.0s/5m0s

running (4m20.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m20.0s/5m0s

running (4m21.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m21.0s/5m0s

running (4m22.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m22.0s/5m0s

running (4m23.0s), 10/10 VUs, 188 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m23.0s/5m0s

running (4m24.0s), 10/10 VUs, 188 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m24.0s/5m0s

running (4m25.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m25.0s/5m0s

running (4m26.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m26.0s/5m0s

running (4m27.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m27.0s/5m0s

running (4m28.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m28.0s/5m0s

running (4m29.0s), 10/10 VUs, 191 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m29.0s/5m0s

running (4m30.0s), 10/10 VUs, 192 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m30.0s/5m0s

running (4m31.0s), 10/10 VUs, 192 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m31.0s/5m0s

running (4m32.0s), 10/10 VUs, 193 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m32.0s/5m0s

running (4m33.0s), 10/10 VUs, 194 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m33.0s/5m0s

running (4m34.0s), 10/10 VUs, 195 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m34.0s/5m0s

running (4m35.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m35.0s/5m0s

running (4m36.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m36.0s/5m0s

running (4m37.0s), 10/10 VUs, 198 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m37.0s/5m0s

running (4m38.0s), 10/10 VUs, 198 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m38.0s/5m0s

running (4m39.0s), 10/10 VUs, 199 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m39.0s/5m0s

running (4m40.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m40.0s/5m0s

running (4m41.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m41.0s/5m0s

running (4m42.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m42.0s/5m0s

running (4m43.0s), 10/10 VUs, 201 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m43.0s/5m0s

running (4m44.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m44.0s/5m0s

running (4m45.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m45.0s/5m0s

running (4m46.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m46.0s/5m0s

running (4m47.0s), 10/10 VUs, 205 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m47.0s/5m0s

running (4m48.0s), 10/10 VUs, 205 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m48.0s/5m0s

running (4m49.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m49.0s/5m0s

running (4m50.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m50.0s/5m0s

running (4m51.0s), 10/10 VUs, 209 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m51.0s/5m0s

running (4m52.0s), 10/10 VUs, 209 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m52.0s/5m0s

running (4m53.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m53.0s/5m0s

running (4m54.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m54.0s/5m0s

running (4m55.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m55.0s/5m0s

running (4m56.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m56.0s/5m0s

running (4m57.0s), 10/10 VUs, 211 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m57.0s/5m0s

running (4m58.0s), 10/10 VUs, 212 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m58.0s/5m0s

running (4m59.0s), 10/10 VUs, 213 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m59.0s/5m0s

running (5m00.0s), 10/10 VUs, 213 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  5m00.0s/5m0s

running (5m01.0s), 09/10 VUs, 214 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m02.0s), 07/10 VUs, 216 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m03.0s), 07/10 VUs, 216 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m04.0s), 05/10 VUs, 218 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m05.0s), 04/10 VUs, 219 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m06.0s), 04/10 VUs, 219 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m07.0s), 03/10 VUs, 220 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m08.0s), 03/10 VUs, 220 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m09.0s), 03/10 VUs, 220 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m10.0s), 03/10 VUs, 220 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m11.0s), 02/10 VUs, 221 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m12.0s), 01/10 VUs, 222 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.99' rate=78.02%

    http_req_duration{endpoint:analyze_chat}
    ✓ 'p(95)<1500' p(95)=2.6ms

    http_req_duration{endpoint:analyze_metadata}
    ✓ 'p(95)<1000' p(95)=2.21ms

    http_req_duration{endpoint:analyze_photo}
    ✓ 'p(95)<2500' p(95)=0s

    http_req_duration{endpoint:generate_evidence_report}
    ✓ 'p(95)<4000' p(95)=0s

    http_req_duration{endpoint:generate_trust_score}
    ✓ 'p(95)<2500' p(95)=0s

    http_req_duration{endpoint:get_pattern_analytics}
    ✓ 'p(95)<1500' p(95)=0s

    http_req_duration{endpoint:get_timeline}
    ✓ 'p(95)<1000' p(95)=0s

    http_req_duration{endpoint:get_trust_report}
    ✓ 'p(95)<1000' p(95)=0s

    http_req_duration{endpoint:health}
    ✓ 'p(95)<200' p(95)=1.16ms

    http_req_duration{endpoint:list_reports}
    ✓ 'p(95)<1000' p(95)=0s

    http_req_failed
    ✗ 'rate<0.01' rate=43.94%


  █ TOTAL RESULTS 

    checks_total.......: 4014   12.856628/s
    checks_succeeded...: 78.02% 3132 out of 4014
    checks_failed......: 21.97% 882 out of 4014

    ✓ health: status is 200
    ✓ health: response time < 5s
    ✗ register: status is 200
      ↳  4% — ✓ 10 / ✗ 213
    ✓ register: response time < 5s
    ✓ login: status is 200
    ✓ login: response time < 5s
    ✓ analyze_chat: status is 200
    ✓ analyze_chat: response time < 5s
    ✗ analyze_metadata: status is 200
      ↳  0% — ✓ 0 / ✗ 223
    ✓ analyze_metadata: response time < 5s
    ✗ subscription_tiers: status is 200
      ↳  0% — ✓ 0 / ✗ 223
    ✓ subscription_tiers: response time < 5s
    ✓ usage_status: status is 200
    ✓ usage_status: response time < 5s
    ✗ safety_replies: status is 200
      ↳  0% — ✓ 0 / ✗ 223
    ✓ safety_replies: response time < 5s
    ✓ community_stats: status is 200
    ✓ community_stats: response time < 5s

    HTTP
    http_req_duration.........................: avg=2.22ms   min=464.13µs med=1.72ms   max=66.54ms p(90)=4.6ms    p(95)=5.19ms
      { endpoint:analyze_chat }...............: avg=2.12ms   min=1.56ms   med=2.08ms   max=4.09ms  p(90)=2.4ms    p(95)=2.6ms 
      { endpoint:analyze_metadata }...........: avg=1.75ms   min=1.15ms   med=1.7ms    max=6.36ms  p(90)=2.05ms   p(95)=2.21ms
      { endpoint:analyze_photo }..............: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:generate_evidence_report }...: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:generate_trust_score }.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:get_pattern_analytics }......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:get_timeline }...............: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:get_trust_report }...........: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { endpoint:health }.....................: avg=818.29µs min=464.13µs med=756.24µs max=2.82ms  p(90)=964.56µs p(95)=1.16ms
      { endpoint:list_reports }...............: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s    
      { expected_response:true }..............: avg=2.55ms   min=464.13µs med=2.11ms   max=66.54ms p(90)=5.08ms   p(95)=5.39ms
    http_req_failed...........................: 43.94% 882 out of 2007
    http_reqs.................................: 2007   6.428314/s

    EXECUTION
    iteration_duration........................: avg=13.7s    min=11.03s   med=13.71s   max=15.84s  p(90)=14.78s   p(95)=15.2s 
    iterations................................: 223    0.714257/s
    vus.......................................: 1      min=1           max=10
    vus_max...................................: 10     min=10          max=10

    NETWORK
    data_received.............................: 538 kB 1.7 kB/s
    data_sent.................................: 338 kB 1.1 kB/s



running (5m12.2s), 00/10 VUs, 223 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  5m0s
time="2025-11-20T23:55:13Z" level=error msg="thresholds on metrics 'checks, http_req_failed' have been crossed"